{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution689_weight", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution689", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm650_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm650_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm650_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm650_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm650", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu610", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "poolStart", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like285", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis285", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform285", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout285", 
      "attr": {"p": "0.0142857"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add285", 
      "inputs": [[11, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution690_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution690", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm651_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm651_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm651_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm651_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm651", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu611", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution691_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution691", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm652_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm652_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm652_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm652_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm652", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul285", 
      "inputs": [[13, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus285", 
      "inputs": [[9, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where285", 
      "inputs": [[14, 0, 0], [31, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu612", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like286", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis286", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform286", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout286", 
      "attr": {"p": "0.0285714"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add286", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution692_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution692", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm653_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm653_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm653_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm653_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm653", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu613", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution693_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution693", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm654_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm654_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm654_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm654_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm654", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul286", 
      "inputs": [[37, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus286", 
      "inputs": [[33, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where286", 
      "inputs": [[38, 0, 0], [55, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu614", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like287", 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis287", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform287", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout287", 
      "attr": {"p": "0.0428571"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add287", 
      "inputs": [[59, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution694_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution694", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm655_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm655_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm655_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm655_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm655", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu615", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution695_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution695", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm656_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm656_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm656_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm656_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm656", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul287", 
      "inputs": [[61, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus287", 
      "inputs": [[57, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where287", 
      "inputs": [[62, 0, 0], [79, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu616", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like288", 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis288", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform288", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout288", 
      "attr": {"p": "0.0571429"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add288", 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution698_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution698", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[81, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm659_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm659_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm659_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm659_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm659", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution696_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution696", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[81, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm657_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm657_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm657_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm657_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm657", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu617", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution697_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution697", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm658_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm658_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm658_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm658_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm658", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul288", 
      "inputs": [[85, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus288", 
      "inputs": [[93, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where288", 
      "inputs": [[86, 0, 0], [110, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu618", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like289", 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis289", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform289", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout289", 
      "attr": {"p": "0.0714286"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add289", 
      "inputs": [[114, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution699_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution699", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm660_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm660_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm660_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm660_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm660", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu619", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution700_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution700", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm661_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm661_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm661_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm661_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm661", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul289", 
      "inputs": [[116, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus289", 
      "inputs": [[112, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where289", 
      "inputs": [[117, 0, 0], [134, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu620", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like290", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis290", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform290", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout290", 
      "attr": {"p": "0.0857143"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add290", 
      "inputs": [[138, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution701_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution701", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[136, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm662_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm662_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm662_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm662_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm662", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 1], [147, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu621", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution702_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution702", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm663_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm663_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm663_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm663_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm663", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul290", 
      "inputs": [[140, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus290", 
      "inputs": [[136, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where290", 
      "inputs": [[141, 0, 0], [158, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu622", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like291", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis291", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform291", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout291", 
      "attr": {"p": "0.1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add291", 
      "inputs": [[162, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution703_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution703", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[160, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm664_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm664_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm664_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm664_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm664", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu623", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution704_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution704", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm665_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm665_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm665_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm665_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm665", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul291", 
      "inputs": [[164, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus291", 
      "inputs": [[160, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where291", 
      "inputs": [[165, 0, 0], [182, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu624", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution100_weight", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution100", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution101_weight", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution101", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution102_weight", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution102", 
      "attr": {
        "adj": "(0, 0)", 
        "kernel": "(2, 2)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution705_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution705", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput39", 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    15, 
    17, 
    18, 
    19, 
    20, 
    23, 
    25, 
    26, 
    27, 
    28, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    49, 
    50, 
    51, 
    52, 
    63, 
    65, 
    66, 
    67, 
    68, 
    71, 
    73, 
    74, 
    75, 
    76, 
    87, 
    89, 
    90, 
    91, 
    92, 
    94, 
    96, 
    97, 
    98, 
    99, 
    102, 
    104, 
    105, 
    106, 
    107, 
    118, 
    120, 
    121, 
    122, 
    123, 
    126, 
    128, 
    129, 
    130, 
    131, 
    142, 
    144, 
    145, 
    146, 
    147, 
    150, 
    152, 
    153, 
    154, 
    155, 
    166, 
    168, 
    169, 
    170, 
    171, 
    174, 
    176, 
    177, 
    178, 
    179, 
    185, 
    187, 
    189, 
    191, 
    193
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    39, 
    40, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    75, 
    76, 
    77, 
    78, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    106, 
    107, 
    108, 
    109, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    130, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    141, 
    142, 
    143, 
    144, 
    146, 
    147, 
    148, 
    149, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    161, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    172, 
    173, 
    174, 
    175, 
    177, 
    178, 
    179, 
    180, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    192, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    203, 
    204, 
    205, 
    206, 
    208, 
    209, 
    210, 
    211, 
    213, 
    214, 
    215, 
    216, 
    217, 
    218, 
    219, 
    220, 
    223, 
    225, 
    226, 
    227, 
    228, 
    229, 
    230, 
    231, 
    234, 
    235, 
    236, 
    237, 
    239, 
    240, 
    241, 
    242, 
    243, 
    244, 
    245, 
    246, 
    247, 
    248, 
    249
  ], 
  "heads": [[194, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}