{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution342_weight", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution342", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm303_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm303_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm303_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm303_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm303", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu293", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "poolStart", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like127", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis127", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform127", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout127", 
      "attr": {"p": "0.0333333"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add127", 
      "inputs": [[11, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution343_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution343", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm304_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm304_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm304_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm304_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm304", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu294", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution344_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution344", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm305_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm305_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm305_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm305_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm305", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul127", 
      "inputs": [[13, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus127", 
      "inputs": [[9, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where127", 
      "inputs": [[14, 0, 0], [31, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu295", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like128", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis128", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform128", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout128", 
      "attr": {"p": "0.0666667"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add128", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution345_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution345", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm306_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm306_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm306_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm306_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm306", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu296", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution346_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution346", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm307_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm307_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm307_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm307_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm307", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul128", 
      "inputs": [[37, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus128", 
      "inputs": [[33, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where128", 
      "inputs": [[38, 0, 0], [55, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu297", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like129", 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis129", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform129", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout129", 
      "attr": {"p": "0.1"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add129", 
      "inputs": [[59, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution347_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution347", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm308_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm308_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm308_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm308_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm308", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu298", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution348_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution348", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm309_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm309_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm309_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm309_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm309", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul129", 
      "inputs": [[61, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus129", 
      "inputs": [[57, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where129", 
      "inputs": [[62, 0, 0], [79, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu299", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution39_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution39", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution349_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution349", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput39", 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    15, 
    17, 
    18, 
    19, 
    20, 
    23, 
    25, 
    26, 
    27, 
    28, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    49, 
    50, 
    51, 
    52, 
    63, 
    65, 
    66, 
    67, 
    68, 
    71, 
    73, 
    74, 
    75, 
    76, 
    82, 
    84, 
    86
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    39, 
    40, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    75, 
    76, 
    77, 
    78, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112
  ], 
  "heads": [[87, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}