{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "project_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "project", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu20", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[15, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu22", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[26, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu23", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu24", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[37, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution30_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu25", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution31_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu26", 
      "attrs": {"act_type": "elu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution32_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[51, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "anchor", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 1], [69, 0, 1]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization2", 
      "attrs": {"mode": "spatial"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "_random_uniform", 
      "name": "uniform2", 
      "attrs": {
        "high": "100", 
        "low": "100", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attrs": {
        "no_bias": "1", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {
        "no_bias": "1", 
        "num_hidden": "1"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[71, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "logisticregressionoutput2_label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput2", 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    8, 
    9, 
    10, 
    11, 
    13, 
    16, 
    19, 
    21, 
    22, 
    23, 
    24, 
    27, 
    30, 
    32, 
    33, 
    34, 
    35, 
    38, 
    41, 
    44, 
    46, 
    47, 
    48, 
    49, 
    52, 
    55, 
    58, 
    60, 
    61, 
    62, 
    63, 
    66, 
    67, 
    68, 
    69, 
    73, 
    76, 
    77, 
    79
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    83, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94
  ], 
  "heads": [[80, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}