{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu308", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution364_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution364", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu309", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm140", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "project_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "project", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu310", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution365_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution365", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu311", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout224", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution366_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution366", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu312", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout225", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution367_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution367", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm141", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus168", 
      "inputs": [[15, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution368_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution368", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu313", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout226", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution369_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution369", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu314", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout227", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution370_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution370", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm142", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus169", 
      "inputs": [[31, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution371_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution371", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu315", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout228", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution372_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution372", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu316", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout229", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution373_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution373", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm143", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 1], [61, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus170", 
      "inputs": [[47, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution374_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution374", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu317", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout230", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution375_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution375", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu318", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout231", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution376_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution376", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm144", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 1], [77, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus171", 
      "inputs": [[63, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_gamma", 
      "inputs": []
    }, 
    {
      "op": "sigmoid", 
      "name": "sigmoid28", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "anchor", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[79, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 1], [84, 0, 1]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization28", 
      "attrs": {"mode": "spatial"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar56", 
      "attrs": {"scalar": "10"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims56", 
      "attrs": {"axis": "1"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims57", 
      "attrs": {"axis": "2"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul28", 
      "inputs": [[86, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "logisticRegression", 
      "inputs": [[93, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    8, 
    9, 
    10, 
    11, 
    13, 
    16, 
    20, 
    24, 
    26, 
    27, 
    28, 
    29, 
    32, 
    36, 
    40, 
    42, 
    43, 
    44, 
    45, 
    48, 
    52, 
    56, 
    58, 
    59, 
    60, 
    61, 
    64, 
    68, 
    72, 
    74, 
    75, 
    76, 
    77, 
    80, 
    82, 
    83, 
    84, 
    91, 
    92
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    43, 
    44, 
    45, 
    46, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    63, 
    64, 
    65, 
    66, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    77, 
    78, 
    79, 
    80, 
    81, 
    83, 
    84, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    106, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116
  ], 
  "heads": [[94, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}