{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution206_weight", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution206", 
      "attr": {
        "kernel": "(9, 9)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(4, 4)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm188_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm188_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm188_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm188_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm188", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu167", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "poolStart", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like68", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis80", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform68", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout72", 
      "attr": {"p": "0.05"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add68", 
      "inputs": [[11, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution207_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution207", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm189_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm189_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm189_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm189_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm189", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu168", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution208_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution208", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm190_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm190_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm190_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm190_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm190", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul72", 
      "inputs": [[13, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus72", 
      "inputs": [[9, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where68", 
      "inputs": [[14, 0, 0], [31, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu169", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like69", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_axis81", 
      "attr": {
        "axis": "0", 
        "exclude": "1", 
        "keepdims": "0"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "random_uniform", 
      "name": "random_uniform69", 
      "attr": {
        "high": "1", 
        "low": "1", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout73", 
      "attr": {"p": "0.1"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add69", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution209_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution209", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm191_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm191_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm191_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm191_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm191", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu170", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution210_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution210", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm192_gamma", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm192_beta", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm192_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm192_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm192", 
      "attr": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul73", 
      "inputs": [[37, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus73", 
      "inputs": [[33, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "where", 
      "name": "where69", 
      "inputs": [[38, 0, 0], [55, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu171", 
      "attr": {"act_type": "rrelu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconvolution18_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconvolution18", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution211_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution211", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logisticregressionoutput18", 
      "inputs": [[62, 0, 0], [63, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    15, 
    17, 
    18, 
    19, 
    20, 
    23, 
    25, 
    26, 
    27, 
    28, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    49, 
    50, 
    51, 
    52, 
    58, 
    60, 
    63
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    39, 
    40, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82
  ], 
  "heads": [[64, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}