{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar30", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3270", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad220", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile4120", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5200", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3470", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3250", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3271", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1950", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1950", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile4123", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5203", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3273", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4122", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5202", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3472", 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3252", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1520", 
      "inputs": [[18, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1300", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1300", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1300", 
      "inputs": [[20, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5204", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5421", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3471", 
      "inputs": [[20, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3251", 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3272", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1951", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1951", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5423", 
      "inputs": [[30, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4125", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5206", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3275", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4124", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5205", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3474", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3254", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1521", 
      "inputs": [[42, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1301", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1301", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1301", 
      "inputs": [[44, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5207", 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5425", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3473", 
      "inputs": [[44, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3253", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3274", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1952", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1952", 
      "inputs": [[58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5427", 
      "inputs": [[54, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like650", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1300", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5420", 
      "inputs": [[66, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5422", 
      "inputs": [[67, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1301", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5424", 
      "inputs": [[70, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5426", 
      "inputs": [[71, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in1_out3_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[14, 0, 0], [39, 0, 0], [63, 0, 0], [65, 0, 0], [69, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[5,5]_initialConvs_0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square440", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split220", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1522", 
      "inputs": [[77, 0, 0], [77, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar670", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt440", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square441", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar672", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt441", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div440", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_(1,1,12,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu220", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar671", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3475", 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div441", 
      "inputs": [[88, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4126", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5428", 
      "inputs": [[75, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad221", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile4127", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5208", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3476", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3255", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3276", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1953", 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1953", 
      "inputs": [[99, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile4134", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5217", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3282", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4133", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5216", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3482", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3261", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1525", 
      "inputs": [[106, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1304", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1304", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1304", 
      "inputs": [[108, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5218", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5438", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3481", 
      "inputs": [[108, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3260", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3281", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1956", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1956", 
      "inputs": [[122, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5440", 
      "inputs": [[118, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4140", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5225", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3287", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4139", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5224", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3487", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3266", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1527", 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1306", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1306", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1306", 
      "inputs": [[131, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5226", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5446", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3486", 
      "inputs": [[131, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3265", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3286", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1959", 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1959", 
      "inputs": [[145, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5448", 
      "inputs": [[141, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[102, 0, 0], [126, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like651", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1304", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5437", 
      "inputs": [[152, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5439", 
      "inputs": [[153, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1290", 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1306", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5445", 
      "inputs": [[156, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5447", 
      "inputs": [[157, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1291", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[151, 0, 0], [155, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[150, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4130", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5211", 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3278", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4129", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5210", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3478", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3257", 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1523", 
      "inputs": [[164, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1302", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1302", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1302", 
      "inputs": [[166, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5212", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5430", 
      "inputs": [[172, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3477", 
      "inputs": [[166, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3256", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3277", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1954", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1954", 
      "inputs": [[180, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5432", 
      "inputs": [[176, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4135", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5219", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3483", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3262", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3283", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1957", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1957", 
      "inputs": [[190, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4142", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5228", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3289", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4141", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5227", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3489", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3268", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1528", 
      "inputs": [[196, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1307", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1307", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1307", 
      "inputs": [[198, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5229", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5450", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3488", 
      "inputs": [[198, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3267", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3288", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1960", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1960", 
      "inputs": [[212, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5452", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[184, 0, 0], [193, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1302", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5429", 
      "inputs": [[218, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5431", 
      "inputs": [[219, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like652", 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1307", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5449", 
      "inputs": [[222, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5451", 
      "inputs": [[223, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1293", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4132", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5214", 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3280", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4131", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5213", 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3480", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3259", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1524", 
      "inputs": [[230, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1303", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1303", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1303", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5215", 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5434", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3479", 
      "inputs": [[232, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3258", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3279", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1955", 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1955", 
      "inputs": [[246, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5436", 
      "inputs": [[242, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4138", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5222", 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3285", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4137", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5221", 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3485", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3264", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1526", 
      "inputs": [[253, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1305", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1305", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1305", 
      "inputs": [[255, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5223", 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5442", 
      "inputs": [[261, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3484", 
      "inputs": [[255, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3263", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3284", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1958", 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1958", 
      "inputs": [[269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5444", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4143", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5230", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3490", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3269", 
      "inputs": [[277, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3290", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1961", 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1961", 
      "inputs": [[279, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[250, 0, 0], [273, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1303", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5433", 
      "inputs": [[284, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5435", 
      "inputs": [[285, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1305", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5441", 
      "inputs": [[287, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5443", 
      "inputs": [[288, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like653", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[286, 0, 0], [289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[283, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1292", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[293, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1294", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[295, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1295", 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[297, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[161, 0, 0], [227, 0, 0], [292, 0, 0], [294, 0, 0], [296, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[3,3]_initialConvs_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square442", 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split221", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1529", 
      "inputs": [[302, 0, 0], [302, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar673", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt442", 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square443", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar675", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt443", 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div442", 
      "inputs": [[305, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_(1,1,21,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu221", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar674", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3491", 
      "inputs": [[309, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div443", 
      "inputs": [[313, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4145", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5453", 
      "inputs": [[300, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad223", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4165", 
      "attrs": {"reps": "(6, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5256", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s77_Ord0_radial_(1,1,6,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3508", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s77_Ord0_radial_(1,1,6,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3285", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3306", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1971", 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1971", 
      "inputs": [[323, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4172", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5265", 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3312", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4171", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5264", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s77_Ord1_angular_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3514", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s77_Ord1_angular_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3291", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1539", 
      "inputs": [[329, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1316", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1316", 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1316", 
      "inputs": [[331, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5266", 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5488", 
      "inputs": [[337, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s77_Ord1_radial_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3513", 
      "inputs": [[331, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s77_Ord1_radial_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3290", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3311", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1974", 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1974", 
      "inputs": [[345, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5490", 
      "inputs": [[341, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4178", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5273", 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3317", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4177", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5272", 
      "inputs": [[353, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s77_Ord2_angular_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3519", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s77_Ord2_angular_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3296", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1541", 
      "inputs": [[352, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1318", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1318", 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1318", 
      "inputs": [[354, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5274", 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5496", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s77_Ord2_radial_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3518", 
      "inputs": [[354, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s77_Ord2_radial_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3295", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3316", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1977", 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1977", 
      "inputs": [[368, 0, 0], [370, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5498", 
      "inputs": [[364, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_1_2_s77", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[326, 0, 0], [349, 0, 0], [372, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like657", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1316", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5487", 
      "inputs": [[375, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5489", 
      "inputs": [[376, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1302", 
      "inputs": [[377, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1318", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5495", 
      "inputs": [[379, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5497", 
      "inputs": [[380, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1303", 
      "inputs": [[381, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_1_2_s77", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[374, 0, 0], [378, 0, 0], [382, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_1_2_s77", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[373, 0, 0], [383, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4168", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5259", 
      "inputs": [[385, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3308", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4167", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5258", 
      "inputs": [[388, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s77_Ord1_angular_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3510", 
      "inputs": [[389, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s77_Ord1_angular_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3287", 
      "inputs": [[391, 0, 0], [392, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1537", 
      "inputs": [[387, 0, 0], [393, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1314", 
      "inputs": [[394, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1314", 
      "inputs": [[389, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1314", 
      "inputs": [[389, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
