{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar4", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar64", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad112", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu56", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar65", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad113", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution108_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution108", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm56_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm56_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm56_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm56_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm56", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad114", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution109_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution109", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu57", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar66", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad115", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution110_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution110", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm57_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm57_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm57_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm57_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm57", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad116", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution111_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution111", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu58", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar67", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad117", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution112_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution112", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm58_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm58_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm58_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm58_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm58", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_1", 
      "inputs": [[15, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad118", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution113_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution113", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu59", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar68", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad119", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution114_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution114", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm59_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm59_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm59_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm59_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm59", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad120", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution115_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution115", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu60", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar69", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad121", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution116_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution116", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm60_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm60_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm60_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm60_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm60", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_2", 
      "inputs": [[42, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad122", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution117_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution117", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu61", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar70", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad123", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution118_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution118", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm61_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm61_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm61_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm61_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm61", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad124", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution119_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution119", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu62", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar71", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad125", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution120_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution120", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm62_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm62_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm62_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm62_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm62", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_3", 
      "inputs": [[69, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad126", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution121_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution121", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu63", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar72", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad127", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution122_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution122", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm63_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm63_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm63_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm63_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm63", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad128", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution123_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution123", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu64", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar73", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad129", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution124_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution124", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm64_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm64_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm64_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm64_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm64", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_4", 
      "inputs": [[96, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad130", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 16, 16, 16, 16)"
      }, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution125_weight", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution125", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu65", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar74", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad131", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 16, 16, 16, 16)"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution126_weight", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution126", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm65_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm65_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm65_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm65_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm65", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad132", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 16, 16, 16, 16)"
      }, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution127_weight", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution127", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu66", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar75", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad133", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 16, 16, 16, 16)"
      }, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution128_weight", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution128", 
      "attrs": {
        "dilate": "(16, 16)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm66_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm66_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm66_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm66_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm66", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_5", 
      "inputs": [[123, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad134", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution129_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution129", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu67", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar76", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad135", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution130_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution130", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm67_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm67_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm67_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm67_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm67", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 1], [162, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_6", 
      "inputs": [[150, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad136", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution131_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution131", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu68", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar77", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad137", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution132_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution132", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm68_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm68_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm68_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm68_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm68", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 1], [176, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_7", 
      "inputs": [[164, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad138", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution133_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution133", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu69", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar78", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad139", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution134_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution134", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm69_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm69_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm69_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm69_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm69", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_8", 
      "inputs": [[178, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "18", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "18", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp4", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum4", 
      "attrs": {
        "axis": "1", 
        "keepdims": "1"
      }, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "softmax", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    4, 
    9, 
    11, 
    12, 
    13, 
    14, 
    17, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    35, 
    37, 
    38, 
    39, 
    40, 
    44, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    62, 
    64, 
    65, 
    66, 
    67, 
    71, 
    76, 
    78, 
    79, 
    80, 
    81, 
    84, 
    89, 
    91, 
    92, 
    93, 
    94, 
    98, 
    103, 
    105, 
    106, 
    107, 
    108, 
    111, 
    116, 
    118, 
    119, 
    120, 
    121, 
    125, 
    130, 
    132, 
    133, 
    134, 
    135, 
    138, 
    143, 
    145, 
    146, 
    147, 
    148, 
    152, 
    157, 
    159, 
    160, 
    161, 
    162, 
    166, 
    171, 
    173, 
    174, 
    175, 
    176, 
    180, 
    185, 
    187, 
    188, 
    189, 
    190, 
    193, 
    195, 
    196
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212, 
    213, 
    214, 
    215, 
    216, 
    217, 
    220, 
    221, 
    222, 
    223, 
    224, 
    225, 
    226, 
    227, 
    228, 
    229
  ], 
  "heads": [[200, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}