{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar3", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar327", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad22", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile412", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad520", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul347", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add325", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar328", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh195", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul195", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile415", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad523", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar330", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile414", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad522", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul349", 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add327", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add152", 
      "inputs": [[18, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos130", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like130", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser130", 
      "inputs": [[20, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad524", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul543", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul348", 
      "inputs": [[20, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add326", 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar329", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh196", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul196", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul545", 
      "inputs": [[30, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile417", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad526", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar332", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile416", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad525", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul351", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add329", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add153", 
      "inputs": [[42, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos131", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like131", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser131", 
      "inputs": [[44, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad527", 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul547", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul350", 
      "inputs": [[44, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add328", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar331", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh197", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul197", 
      "inputs": [[58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul549", 
      "inputs": [[54, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like65", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin130", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul542", 
      "inputs": [[66, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul544", 
      "inputs": [[67, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin131", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul546", 
      "inputs": [[70, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul548", 
      "inputs": [[71, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in1_out3_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[14, 0, 0], [39, 0, 0], [63, 0, 0], [65, 0, 0], [69, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[5,5]_initialConvs_0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square44", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split22", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add154", 
      "inputs": [[77, 0, 0], [77, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar67", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt44", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square45", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar69", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt45", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div44", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_(1,1,12,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu22", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar68", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul352", 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div45", 
      "inputs": [[88, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile418", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul550", 
      "inputs": [[75, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad23", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile419", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad528", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul353", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add330", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar333", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh198", 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul198", 
      "inputs": [[99, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile426", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad537", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar339", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile425", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad536", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul359", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add336", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add157", 
      "inputs": [[106, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos134", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like134", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser134", 
      "inputs": [[108, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad538", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul560", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul358", 
      "inputs": [[108, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add335", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar338", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh201", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul201", 
      "inputs": [[122, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul562", 
      "inputs": [[118, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile432", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad545", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar344", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile431", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad544", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul364", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add341", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add159", 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos136", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like136", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser136", 
      "inputs": [[131, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad546", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul568", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul363", 
      "inputs": [[131, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add340", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar343", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh204", 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul204", 
      "inputs": [[145, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul570", 
      "inputs": [[141, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[102, 0, 0], [126, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like66", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin134", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul559", 
      "inputs": [[152, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul561", 
      "inputs": [[153, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative129", 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin136", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul567", 
      "inputs": [[156, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul569", 
      "inputs": [[157, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative130", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[151, 0, 0], [155, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[150, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile422", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad531", 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar335", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile421", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad530", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul355", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add332", 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add155", 
      "inputs": [[164, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos132", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like132", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser132", 
      "inputs": [[166, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad532", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul552", 
      "inputs": [[172, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul354", 
      "inputs": [[166, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add331", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar334", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh199", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul199", 
      "inputs": [[180, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul554", 
      "inputs": [[176, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile427", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad539", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul360", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add337", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar340", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh202", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul202", 
      "inputs": [[190, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile434", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad548", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar346", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile433", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad547", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul366", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add343", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add160", 
      "inputs": [[196, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos137", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like137", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser137", 
      "inputs": [[198, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad549", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul572", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul365", 
      "inputs": [[198, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add342", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar345", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh205", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul205", 
      "inputs": [[212, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul574", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[184, 0, 0], [193, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin132", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul551", 
      "inputs": [[218, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul553", 
      "inputs": [[219, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like67", 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin137", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul571", 
      "inputs": [[222, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul573", 
      "inputs": [[223, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative132", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile424", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad534", 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar337", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile423", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad533", 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul357", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add334", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add156", 
      "inputs": [[230, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos133", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like133", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser133", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad535", 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul556", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul356", 
      "inputs": [[232, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add333", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar336", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh200", 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul200", 
      "inputs": [[246, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul558", 
      "inputs": [[242, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile430", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad542", 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar342", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile429", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad541", 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul362", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add339", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add158", 
      "inputs": [[253, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos135", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like135", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser135", 
      "inputs": [[255, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad543", 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul564", 
      "inputs": [[261, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul361", 
      "inputs": [[255, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add338", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar341", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh203", 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul203", 
      "inputs": [[269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul566", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile435", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad550", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul367", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add344", 
      "inputs": [[277, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar347", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh206", 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul206", 
      "inputs": [[279, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[250, 0, 0], [273, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin133", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul555", 
      "inputs": [[284, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul557", 
      "inputs": [[285, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin135", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul563", 
      "inputs": [[287, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul565", 
      "inputs": [[288, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like68", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[286, 0, 0], [289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[283, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative131", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[293, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative133", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[295, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative134", 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[297, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[161, 0, 0], [227, 0, 0], [292, 0, 0], [294, 0, 0], [296, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[3,3]_initialConvs_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square46", 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split23", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add161", 
      "inputs": [[302, 0, 0], [302, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar70", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt46", 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square47", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar72", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt47", 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div46", 
      "inputs": [[305, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_(1,1,21,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu23", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar71", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul368", 
      "inputs": [[309, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div47", 
      "inputs": [[313, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile437", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul575", 
      "inputs": [[300, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad25", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile457", 
      "attrs": {"reps": "(6, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad576", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s63_Ord0_radial_(1,1,6,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul385", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s63_Ord0_radial_(1,1,6,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add360", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar363", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh216", 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul216", 
      "inputs": [[323, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile464", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad585", 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar369", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile463", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad584", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s63_Ord1_angular_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul391", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s63_Ord1_angular_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add366", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add171", 
      "inputs": [[329, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos146", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like146", 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser146", 
      "inputs": [[331, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad586", 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul610", 
      "inputs": [[337, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s63_Ord1_radial_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul390", 
      "inputs": [[331, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s63_Ord1_radial_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add365", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar368", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh219", 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul219", 
      "inputs": [[345, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul612", 
      "inputs": [[341, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile470", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad593", 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar374", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile469", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad592", 
      "inputs": [[353, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s63_Ord2_angular_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul396", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s63_Ord2_angular_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add371", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add173", 
      "inputs": [[352, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos148", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like148", 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser148", 
      "inputs": [[354, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad594", 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul618", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s63_Ord2_radial_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul395", 
      "inputs": [[354, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s63_Ord2_radial_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add370", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar373", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh222", 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul222", 
      "inputs": [[368, 0, 0], [370, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul620", 
      "inputs": [[364, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_1_2_s63", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[326, 0, 0], [349, 0, 0], [372, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like72", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin146", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul609", 
      "inputs": [[375, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul611", 
      "inputs": [[376, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative141", 
      "inputs": [[377, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin148", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul617", 
      "inputs": [[379, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul619", 
      "inputs": [[380, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative142", 
      "inputs": [[381, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_1_2_s63", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[374, 0, 0], [378, 0, 0], [382, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_1_2_s63", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[373, 0, 0], [383, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile460", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad579", 
      "inputs": [[385, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar365", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile459", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad578", 
      "inputs": [[388, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s63_Ord1_angular_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul387", 
      "inputs": [[389, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s63_Ord1_angular_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add362", 
      "inputs": [[391, 0, 0], [392, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add169", 
      "inputs": [[387, 0, 0], [393, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos144", 
      "inputs": [[394, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like144", 
      "inputs": [[389, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser144", 
      "inputs": [[389, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad580", 
      "inputs": [[397, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul602", 
      "inputs": [[395, 0, 0], [398, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s63_Ord1_radial_(1,1,6,10)_weight", 
      "inputs": []
