{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile0", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh0", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile3", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad3", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile2", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad2", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add0", 
      "inputs": [[18, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos0", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like0", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser0", 
      "inputs": [[20, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad4", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[20, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh1", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul3", 
      "inputs": [[30, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile5", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad6", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar5", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile4", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad5", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul4", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1", 
      "inputs": [[42, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser1", 
      "inputs": [[44, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad7", 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul5", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3", 
      "inputs": [[44, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh2", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul7", 
      "inputs": [[54, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like0", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin0", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul0", 
      "inputs": [[66, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul2", 
      "inputs": [[67, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul4", 
      "inputs": [[70, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul6", 
      "inputs": [[71, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in1_out3_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[14, 0, 0], [39, 0, 0], [63, 0, 0], [65, 0, 0], [69, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[5,5]_initialConvs_0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add2", 
      "inputs": [[77, 0, 0], [77, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt0", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square1", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt1", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div0", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_(1,1,12,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul5", 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div1", 
      "inputs": [[88, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile6", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul8", 
      "inputs": [[75, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile7", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad8", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul6", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar6", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh3", 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[99, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile14", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad17", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar12", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile13", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad16", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul12", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add5", 
      "inputs": [[106, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos4", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like4", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser4", 
      "inputs": [[108, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad18", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul18", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul11", 
      "inputs": [[108, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar11", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh6", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[122, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul20", 
      "inputs": [[118, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile20", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad25", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar17", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile19", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad24", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul17", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add16", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add7", 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos6", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like6", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser6", 
      "inputs": [[131, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad26", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul26", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul16", 
      "inputs": [[131, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add15", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar16", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh9", 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[145, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul28", 
      "inputs": [[141, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[102, 0, 0], [126, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like1", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin4", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul17", 
      "inputs": [[152, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul19", 
      "inputs": [[153, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative0", 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin6", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul25", 
      "inputs": [[156, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul27", 
      "inputs": [[157, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative1", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[151, 0, 0], [155, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[150, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile10", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad11", 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar8", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile9", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad10", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul8", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add3", 
      "inputs": [[164, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos2", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like2", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser2", 
      "inputs": [[166, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad12", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul10", 
      "inputs": [[172, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul7", 
      "inputs": [[166, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar7", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh4", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[180, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul12", 
      "inputs": [[176, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile15", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad19", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add12", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar13", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh7", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[190, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile22", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad28", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar19", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile21", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad27", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul19", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add18", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add8", 
      "inputs": [[196, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos7", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like7", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser7", 
      "inputs": [[198, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad29", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul30", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul18", 
      "inputs": [[198, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add17", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar18", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh10", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[212, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul32", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[184, 0, 0], [193, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin2", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul9", 
      "inputs": [[218, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul11", 
      "inputs": [[219, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like2", 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin7", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul29", 
      "inputs": [[222, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul31", 
      "inputs": [[223, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative3", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile12", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad14", 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar10", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile11", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad13", 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul10", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add4", 
      "inputs": [[230, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos3", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like3", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser3", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad15", 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul14", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul9", 
      "inputs": [[232, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar9", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh5", 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[246, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul16", 
      "inputs": [[242, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile18", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad22", 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar15", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile17", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad21", 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul15", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add14", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add6", 
      "inputs": [[253, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos5", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like5", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser5", 
      "inputs": [[255, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad23", 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul22", 
      "inputs": [[261, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul14", 
      "inputs": [[255, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add13", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar14", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh8", 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul24", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile23", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad30", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul20", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add19", 
      "inputs": [[277, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar20", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh11", 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[279, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[250, 0, 0], [273, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin3", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul13", 
      "inputs": [[284, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul15", 
      "inputs": [[285, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin5", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul21", 
      "inputs": [[287, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul23", 
      "inputs": [[288, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like3", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[286, 0, 0], [289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[283, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative2", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[293, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative4", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[295, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative5", 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[297, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[161, 0, 0], [227, 0, 0], [292, 0, 0], [294, 0, 0], [296, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[3,3]_initialConvs_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square2", 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add9", 
      "inputs": [[302, 0, 0], [302, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt2", 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square3", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar5", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt3", 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div2", 
      "inputs": [[305, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_(1,1,21,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar4", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul21", 
      "inputs": [[309, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div3", 
      "inputs": [[313, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile25", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul33", 
      "inputs": [[300, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile45", 
      "attrs": {"reps": "(6, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad56", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s46_Ord0_radial_(1,1,6,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul38", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_1_2_s46_Ord0_radial_(1,1,6,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add35", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar36", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh21", 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul21", 
      "inputs": [[323, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile52", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad65", 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar42", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile51", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad64", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s46_Ord1_angular_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul44", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s46_Ord1_angular_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add41", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add19", 
      "inputs": [[329, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos16", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like16", 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser16", 
      "inputs": [[331, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad66", 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul68", 
      "inputs": [[337, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s46_Ord1_radial_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul43", 
      "inputs": [[331, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_1_2_s46_Ord1_radial_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add40", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar41", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh24", 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul24", 
      "inputs": [[345, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul70", 
      "inputs": [[341, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile58", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad73", 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar47", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile57", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad72", 
      "inputs": [[353, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s46_Ord2_angular_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul49", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s46_Ord2_angular_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add46", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add21", 
      "inputs": [[352, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos18", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like18", 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser18", 
      "inputs": [[354, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad74", 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul76", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s46_Ord2_radial_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul48", 
      "inputs": [[354, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_1_2_s46_Ord2_radial_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add45", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar46", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh27", 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul27", 
      "inputs": [[368, 0, 0], [370, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul78", 
      "inputs": [[364, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_1_2_s46", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[326, 0, 0], [349, 0, 0], [372, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like7", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin16", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul67", 
      "inputs": [[375, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul69", 
      "inputs": [[376, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative12", 
      "inputs": [[377, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin18", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul75", 
      "inputs": [[379, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul77", 
      "inputs": [[380, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative13", 
      "inputs": [[381, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_1_2_s46", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[374, 0, 0], [378, 0, 0], [382, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_1_2_s46", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[373, 0, 0], [383, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile48", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad59", 
      "inputs": [[385, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar38", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile47", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad58", 
      "inputs": [[388, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s46_Ord1_angular_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul40", 
      "inputs": [[389, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s46_Ord1_angular_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add37", 
      "inputs": [[391, 0, 0], [392, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add17", 
      "inputs": [[387, 0, 0], [393, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos14", 
      "inputs": [[394, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like14", 
      "inputs": [[389, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser14", 
      "inputs": [[389, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad60", 
      "inputs": [[397, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul60", 
      "inputs": [[395, 0, 0], [398, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s46_Ord1_radial_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul39", 
      "inputs": [[389, 0, 0], [400, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_1_2_s46_Ord1_radial_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add36", 
      "inputs": [[401, 0, 0], [402, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar37", 
