{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "cast123", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast124", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar9", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar327", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad54", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile1008", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1272", 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul849", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add795", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat699", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile1011", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1275", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar328", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1010", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1274", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul851", 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add797", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add372", 
      "inputs": [[17, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos318", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like318", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser318", 
      "inputs": [[19, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1276", 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1327", 
      "inputs": [[25, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul850", 
      "inputs": [[19, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add796", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs318", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1329", 
      "inputs": [[29, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat701", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1013", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1278", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar329", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1012", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1277", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul853", 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add799", 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add373", 
      "inputs": [[39, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos319", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like319", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser319", 
      "inputs": [[41, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1279", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1331", 
      "inputs": [[47, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul852", 
      "inputs": [[41, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add798", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs319", 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1333", 
      "inputs": [[51, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat703", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like159", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat700", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin318", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1326", 
      "inputs": [[61, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1328", 
      "inputs": [[62, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat702", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin319", 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1330", 
      "inputs": [[65, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1332", 
      "inputs": [[66, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat704", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat705", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[13, 0, 0], [36, 0, 0], [58, 0, 0], [60, 0, 0], [64, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast125", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[5,5]_initialConvs_0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square54", 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split54", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add374", 
      "inputs": [[73, 0, 0], [73, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar126", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt54", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh54", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_(1,1,12,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "cast126", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu54", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar127", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul854", 
      "inputs": [[77, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div54", 
      "inputs": [[82, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1014", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1334", 
      "inputs": [[71, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad55", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile1015", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1280", 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul855", 
      "inputs": [[89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add800", 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile1022", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1289", 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar332", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1021", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1288", 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul861", 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add806", 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add377", 
      "inputs": [[97, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos322", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like322", 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser322", 
      "inputs": [[99, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1290", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1344", 
      "inputs": [[105, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul860", 
      "inputs": [[99, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add805", 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs322", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1346", 
      "inputs": [[109, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1028", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1297", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar334", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1027", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1296", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul866", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add811", 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add379", 
      "inputs": [[118, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos324", 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like324", 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser324", 
      "inputs": [[120, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1298", 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1352", 
      "inputs": [[126, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul865", 
      "inputs": [[120, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add810", 
      "inputs": [[132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs324", 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1354", 
      "inputs": [[130, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat706", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[93, 0, 0], [115, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like160", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin322", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1343", 
      "inputs": [[139, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1345", 
      "inputs": [[140, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative321", 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin324", 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1351", 
      "inputs": [[143, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1353", 
      "inputs": [[144, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative322", 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat707", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[138, 0, 0], [142, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat708", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[137, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1018", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1283", 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar330", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1017", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1282", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul857", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add802", 
      "inputs": [[155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add375", 
      "inputs": [[151, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos320", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like320", 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser320", 
      "inputs": [[153, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1284", 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1336", 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul856", 
      "inputs": [[153, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add801", 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs320", 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1338", 
      "inputs": [[163, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1023", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1291", 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul862", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add807", 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1030", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1300", 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar335", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1029", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1299", 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul868", 
      "inputs": [[180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add813", 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add380", 
      "inputs": [[178, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos325", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like325", 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser325", 
      "inputs": [[180, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1301", 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1356", 
      "inputs": [[186, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul867", 
      "inputs": [[180, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add812", 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs325", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1358", 
      "inputs": [[190, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat710", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[169, 0, 0], [175, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin320", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1335", 
      "inputs": [[198, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1337", 
      "inputs": [[199, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like161", 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin325", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1355", 
      "inputs": [[202, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1357", 
      "inputs": [[203, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative324", 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat711", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat712", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[197, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1020", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1286", 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar331", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1019", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1285", 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul859", 
      "inputs": [[212, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add804", 
      "inputs": [[214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add376", 
      "inputs": [[210, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos321", 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like321", 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser321", 
      "inputs": [[212, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1287", 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1340", 
      "inputs": [[218, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul858", 
      "inputs": [[212, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add803", 
      "inputs": [[224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs321", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1342", 
      "inputs": [[222, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1026", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1294", 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar333", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1025", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1293", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul864", 
      "inputs": [[233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add809", 
      "inputs": [[235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add378", 
      "inputs": [[231, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos323", 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like323", 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser323", 
      "inputs": [[233, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1295", 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1348", 
      "inputs": [[239, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul863", 
      "inputs": [[233, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add808", 
      "inputs": [[245, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs323", 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1350", 
      "inputs": [[243, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1031", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1302", 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul869", 
      "inputs": [[251, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add814", 
      "inputs": [[253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat714", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[228, 0, 0], [249, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin321", 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1339", 
      "inputs": [[257, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1341", 
      "inputs": [[258, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin323", 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1347", 
      "inputs": [[260, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1349", 
      "inputs": [[261, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like162", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat715", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[259, 0, 0], [262, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat716", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[256, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative323", 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat709", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[266, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative325", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat713", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[268, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative326", 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat717", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[270, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat718", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[148, 0, 0], [207, 0, 0], [265, 0, 0], [267, 0, 0], [269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "cast127", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[3,3]_initialConvs_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square55", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split55", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add381", 
      "inputs": [[276, 0, 0], [276, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar128", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt55", 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh55", 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_(1,1,21,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "cast128", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu55", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar129", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul870", 
      "inputs": [[280, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div55", 
      "inputs": [[285, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1033", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1359", 
      "inputs": [[274, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad56", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1034", 
      "attrs": {"reps": "(6, 6, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1304", 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_3_1_s19_Ord0_radial_(1,1,6,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul871", 
      "inputs": [[291, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_3_1_s19_Ord0_radial_(1,1,6,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add815", 
      "inputs": [[293, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1041", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1313", 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar338", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1040", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1312", 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s19_Ord1_angular_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul877", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s19_Ord1_angular_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add821", 
      "inputs": [[302, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add384", 
      "inputs": [[298, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos328", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like328", 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser328", 
      "inputs": [[300, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1314", 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1369", 
      "inputs": [[306, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s19_Ord1_radial_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul876", 
      "inputs": [[300, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s19_Ord1_radial_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add820", 
      "inputs": [[312, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs328", 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1371", 
      "inputs": [[310, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1047", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1321", 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar340", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1046", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1320", 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s19_Ord2_angular_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul882", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s19_Ord2_angular_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add826", 
      "inputs": [[323, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add386", 
      "inputs": [[319, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos330", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like330", 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser330", 
      "inputs": [[321, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1322", 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1377", 
      "inputs": [[327, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s19_Ord2_radial_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul881", 
      "inputs": [[321, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s19_Ord2_radial_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add825", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs330", 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1379", 
      "inputs": [[331, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat719", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[295, 0, 0], [316, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like163", 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin328", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1368", 
      "inputs": [[340, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1370", 
      "inputs": [[341, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative327", 
      "inputs": [[342, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin330", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1376", 
      "inputs": [[344, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1378", 
      "inputs": [[345, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative328", 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat720", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[339, 0, 0], [343, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat721", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[338, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1037", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1307", 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar336", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1036", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1306", 
      "inputs": [[353, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s19_Ord1_angular_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul873", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s19_Ord1_angular_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add817", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add382", 
      "inputs": [[352, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos326", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like326", 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser326", 
      "inputs": [[354, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1308", 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1361", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s19_Ord1_radial_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul872", 
      "inputs": [[354, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s19_Ord1_radial_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add816", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs326", 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1363", 
      "inputs": [[364, 0, 0], [369, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1042", 
      "attrs": {"reps": "(10, 10, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1315", 
      "inputs": [[371, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_3_1_s19_Ord0_radial_(1,1,10,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul878", 
      "inputs": [[372, 0, 0], [373, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_3_1_s19_Ord0_radial_(1,1,10,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add822", 
      "inputs": [[374, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1049", 
      "attrs": {"reps": "(10, 5, 1, 1)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1324", 
      "inputs": [[377, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar341", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[378, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile1048", 
      "attrs": {"reps": "(10, 5, 1, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1323", 
      "inputs": [[380, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_3_1_s19_Ord1_angular_(1,1,5,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul884", 
      "inputs": [[381, 0, 0], [382, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_3_1_s19_Ord1_angular_(1,1,5,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add828", 
      "inputs": [[383, 0, 0], [384, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add387", 
      "inputs": [[379, 0, 0], [385, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos331", 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like331", 
      "inputs": [[381, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser331", 
      "inputs": [[381, 0, 0], [388, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1325", 
      "inputs": [[389, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1381", 
      "inputs": [[387, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_3_1_s19_Ord1_radial_(1,1,5,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul883", 
      "inputs": [[381, 0, 0], [392, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_3_1_s19_Ord1_radial_(1,1,5,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add827", 
      "inputs": [[393, 0, 0], [394, 0, 0]]
    }, 
    {
      "op": "abs", 
      "name": "abs331", 
      "inputs": [[395, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1383", 
      "inputs": [[391, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat723", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[370, 0, 0], [376, 0, 0], [397, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin326", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1360", 
      "inputs": [[399, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1362", 
      "inputs": [[400, 0, 0], [369, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like164", 
      "inputs": [[376, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin331", 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1380", 
      "inputs": [[403, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul1382", 
      "inputs": [[404, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "negative", 
