{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "pad22", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "0", 
        "num_filter": "16", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar12", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad23", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "0", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution21_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "0", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "0", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad24", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu12", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar13", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad25", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad26", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu13", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar14", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad27", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_1", 
      "inputs": [[15, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad28", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu14", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar15", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad29", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad30", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu15", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar16", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad31", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution29", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_2", 
      "inputs": [[42, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad32", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution30_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution30", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu16", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar17", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad33", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution31_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution31", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm16", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad34", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution32_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution32", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu17", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar18", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad35", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution33_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution33", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm17", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_3", 
      "inputs": [[69, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad36", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution34_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution34", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar19", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad37", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution35_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution35", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm18", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "Pad", 
      "name": "pad38", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution36_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution36", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar20", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad39", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 8, 8, 8, 8)"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution37_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution37", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm19", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_4", 
      "inputs": [[96, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad40", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 4, 4)"
      }, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution38_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution38", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu20", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar21", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad41", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution39_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution39", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm20", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_5", 
      "inputs": [[123, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad42", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution40_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution40", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu21", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1.6733"
      }, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar22", 
      "attrs": {"scalar": "1.0507"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad43", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution41_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution41", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm21", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.95", 
        "use_global_stats": "0"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "skipConn_6", 
      "inputs": [[137, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "18", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "18", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "3", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp1", 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attrs": {
        "axis": "1", 
        "keepdims": "1"
      }, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "softmax", 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    8, 
    9, 
    11, 
    12, 
    13, 
    14, 
    17, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    35, 
    37, 
    38, 
    39, 
    40, 
    44, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    62, 
    64, 
    65, 
    66, 
    67, 
    71, 
    76, 
    78, 
    79, 
    80, 
    81, 
    84, 
    89, 
    91, 
    92, 
    93, 
    94, 
    98, 
    103, 
    105, 
    106, 
    107, 
    108, 
    111, 
    116, 
    118, 
    119, 
    120, 
    121, 
    125, 
    130, 
    132, 
    133, 
    134, 
    135, 
    139, 
    144, 
    146, 
    147, 
    148, 
    149, 
    152, 
    154, 
    155
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182
  ], 
  "heads": [[159, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}