{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "21", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_bias", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "21", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "0", 
        "num_filter": "21", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu284", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution340_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "21", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution340", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "21", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu285", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm140_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm140", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "project_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "project", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu286", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution341_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution341", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu287", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution342_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution342", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu288", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution343_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution343", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm141_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm141", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus112", 
      "inputs": [[15, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution344_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution344", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu289", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution345_weight", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution345", 
      "attrs": {
        "dilate": "(2, 2)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu290", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution346_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution346", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm142_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm142", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus113", 
      "inputs": [[29, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution347_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution347", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu291", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution348_weight", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution348", 
      "attrs": {
        "dilate": "(4, 4)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(4, 4)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu292", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution349_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution349", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm143_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm143", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus114", 
      "inputs": [[43, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution350_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution350", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu293", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution351_weight", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution351", 
      "attrs": {
        "dilate": "(8, 8)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(8, 8)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu294", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution352_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution352", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm144_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm144", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 1], [69, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus115", 
      "inputs": [[57, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_gamma", 
      "inputs": []
    }, 
    {
      "op": "exp", 
      "name": "exp28", 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar28", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log28", 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "anchor", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "1", 
        "momentum": "0.9"
      }, 
      "inputs": [[71, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 1], [78, 0, 1]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "l2normalization28", 
      "attrs": {"mode": "spatial"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "_random_uniform", 
      "name": "uniform28", 
      "attrs": {
        "high": "100", 
        "low": "100", 
        "shape": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected28_weight", 
      "attrs": {
        "no_bias": "1", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected28", 
      "attrs": {
        "no_bias": "1", 
        "num_hidden": "1"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul28", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "0", 
        "num_filter": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "sigmoid", 
      "name": "logisticOutput", 
      "inputs": [[87, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    8, 
    9, 
    10, 
    11, 
    13, 
    16, 
    19, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    33, 
    36, 
    38, 
    39, 
    40, 
    41, 
    44, 
    47, 
    50, 
    52, 
    53, 
    54, 
    55, 
    58, 
    61, 
    64, 
    66, 
    67, 
    68, 
    69, 
    72, 
    76, 
    77, 
    78, 
    82, 
    85, 
    86
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    92, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102
  ], 
  "heads": [[88, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}