{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "no_bias": "0", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "inputConv_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "no_bias": "0", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "inputConv", 
      "attrs": {
        "kernel": "(16, 1)", 
        "no_bias": "0", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "nansum", 
      "name": "squeeze", 
      "attrs": {
        "axis": "2", 
        "keepdims": "0"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu0", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "poolStart", 
      "attrs": {
        "kernel": "6", 
        "pad": "4", 
        "pool_type": "sum", 
        "stride": "4"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "project_weight", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "project", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu2", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu4", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[18, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "dilate": "2", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "2", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "2", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "2", 
        "stride": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 1], [48, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {
        "dilate": "2", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "2", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "2", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "2", 
        "stride": "1"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu6", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 1], [58, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[39, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attrs": {
        "dilate": "4", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "4", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "4", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "4", 
        "stride": "1"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 1], [69, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attrs": {
        "dilate": "4", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "4", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "4", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "4", 
        "stride": "1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu8", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[60, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {
        "dilate": "8", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "8", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "8", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "8", 
        "stride": "1"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {
        "dilate": "8", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "8", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "8", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "8", 
        "stride": "1"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu10", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[81, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attrs": {
        "dilate": "16", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "16", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "16", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "16", 
        "stride": "1"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attrs": {
        "dilate": "16", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "16", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "16", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "16", 
        "stride": "1"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu12", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "attrs": {
        "eps": "2e-005", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[102, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin_weight", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "0", 
        "num_filter": "32", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "nin_bias", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "0", 
        "num_filter": "32", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "0", 
        "num_filter": "32", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "poolFinal", 
      "attrs": {
        "global_pool": "1", 
        "kernel": "2", 
        "pool_type": "avg"
      }, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_gamma", 
      "inputs": []
    }, 
    {
      "op": "exp", 
      "name": "exp0", 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "anchor", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "0", 
        "momentum": "0.9"
      }, 
      "inputs": [[128, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    11, 
    12, 
    13, 
    14, 
    16, 
    19, 
    22, 
    24, 
    25, 
    26, 
    27, 
    29, 
    32, 
    34, 
    35, 
    36, 
    37, 
    40, 
    43, 
    45, 
    46, 
    47, 
    48, 
    50, 
    53, 
    55, 
    56, 
    57, 
    58, 
    61, 
    64, 
    66, 
    67, 
    68, 
    69, 
    71, 
    74, 
    76, 
    77, 
    78, 
    79, 
    82, 
    85, 
    87, 
    88, 
    89, 
    90, 
    92, 
    95, 
    97, 
    98, 
    99, 
    100, 
    103, 
    106, 
    108, 
    109, 
    110, 
    111, 
    113, 
    116, 
    118, 
    119, 
    120, 
    121, 
    124, 
    125, 
    129, 
    133, 
    134, 
    135
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    162
  ], 
  "heads": [[136, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}